src/Documents/уатВзаимозачет/уатВзаимозачет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>уатВзаимозачет</name>
  <registerRecords>AccumulationRegister.уатВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Дебитор</name>
    <comment>Контрагент, который имеет долги перед нами</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кредитор</name>
    <comment>Контрагент, которому мы должны</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Мультивалютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <comment>Договора и сделки по которым выполняется взаимозачет</comment>
    <attributes>
      <name>ДоговорДебитора</name>
      <comment>Договор взаиморасчетов дебитора</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКредитора</name>
      <comment>Договор взаиморасчетов кредитора</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СделкаДебитора</name>
      <comment>Сделка, по которой дебитор должен нам</comment>
      <type>
        <types>DocumentRef.уатРеализацияУслуг</types>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
        <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
        <types>DocumentRef.уатСчетНаОплатуПоставщика</types>
        <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СделкаКредитора</name>
      <comment>Сделка, по которой мы должны кредитору</comment>
      <type>
        <types>DocumentRef.уатРеализацияУслуг</types>
        <types>DocumentRef.уатЗаказГрузоотправителя</types>
        <types>DocumentRef.уатСчетНаОплатуПокупателю</types>
        <types>DocumentRef.уатСчетНаОплатуПоставщика</types>
        <types>DocumentRef.уатПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КурсДебитора</name>
      <comment>Курс валюты договора дебитора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьДебитора</name>
      <comment>Кратность валюты договора дебитора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КурсКредитора</name>
      <comment>Курс валюты договора кредитора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КратностьКредитора</name>
      <comment>Кратность валюты договора кредитора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДебитора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКредитора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаДебитора</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаКредитора</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/уатВзаимозачет/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Подразделение)";
	
	Ограничение.ТекстДляВнешнихПользователей = Ограничение.Текст;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Дебитор");
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	уатВзаимозачетСостав.Ссылка.Дата КАК Период,
	|	уатВзаимозачетСостав.Ссылка КАК Регистратор,
	|	уатВзаимозачетСостав.Ссылка.Кредитор КАК Контрагент,
	|	уатВзаимозачетСостав.Ссылка.Организация КАК Организация,
	|	уатВзаимозачетСостав.СделкаКредитора КАК Сделка,
	|	уатВзаимозачетСостав.ДоговорКредитора КАК ДоговорКонтрагента,
	|	уатВзаимозачетСостав.ВалютаКредитора КАК Валюта,
	|	уатВзаимозачетСостав.КурсКредитора КАК Курс,
	|	уатВзаимозачетСостав.КратностьКредитора КАК Кратность,
	|	уатВзаимозачетСостав.СуммаКредитора КАК СуммаВзаиморасчетов,
	|	уатВзаимозачетСостав.СуммаКредитора КАК СуммаУпр
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	уатВзаимозачетСостав.Ссылка.Дата,
	|	уатВзаимозачетСостав.Ссылка,
	|	уатВзаимозачетСостав.Ссылка.Дебитор,
	|	уатВзаимозачетСостав.Ссылка.Организация,
	|	уатВзаимозачетСостав.СделкаДебитора,
	|	уатВзаимозачетСостав.ДоговорДебитора,
	|	уатВзаимозачетСостав.ВалютаДебитора,
	|	уатВзаимозачетСостав.КурсДебитора,
	|	уатВзаимозачетСостав.КратностьДебитора,
	|	уатВзаимозачетСостав.СуммаДебитора,
	|	уатВзаимозачетСостав.СуммаДебитора
	|ИЗ
	|	Документ.уатВзаимозачет.Состав КАК уатВзаимозачетСостав
	|ГДЕ
	|	уатВзаимозачетСостав.Ссылка = &Ссылка";
	
	тблВзаиморасчеты = мЗапрос.Выполнить().Выгрузить();
	
	Для Каждого ТекСтрока Из тблВзаиморасчеты Цикл
		Если СтруктураДополнительныеСвойства.Свойство("ВалютаУпрУчета") Тогда
			Если ТекСтрока.Валюта <> СтруктураДополнительныеСвойства.ВалютаУпрУчета Тогда
				ТекСтрока.СуммаУпр = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ТекСтрока.СуммаУпр,
					ТекСтрока.Валюта,    СтруктураДополнительныеСвойства.ВалютаУпрУчета,
					ТекСтрока.Курс,      СтруктураДополнительныеСвойства.КурсУпр,
					ТекСтрока.Кратность, СтруктураДополнительныеСвойства.КратностьУпр);
			КонецЕсли;
		Иначе
			ТекСтрока.СтоимостьУпр = 0;								
		КонецЕсли;
	КонецЦикла;
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчетов", тблВзаиморасчеты);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	Заглушка = Истина;	
КонецПроцедуры // ВыполнитьКонтроль()

#КонецОбласти

#КонецЕсли
